{
    "basic": {
        "language": "PL",
        "may": "May",
        "july": "July",
        "august": "August",
        "october": "October",
        "currently": "Now"
    },
    "landingPage": {
        "aboutMe": "About Me",
        "projects": "Projects",
        "experience": "Experience",
        "welcomeMsg": "Hello, I'm Aleks",
        "welcomeInfo": "Full-Stack Web Developer",
        "knowMe": "Get to know me better!"
    },
    "aboutMe": {
        "theBeginning": "The beginning of an adventure",
        "currentState": "The current state",
        "futurePlans": "Future plans",
        "theBeginningMsg": "My connection with programming dates back to middle school. Since then, I've dabbled in many programming languages, but the one that has become the basis of my adventure is the C++ language. ",
        "currentStateMsg": "I am a Full-Stack Web Developer. I am involved in developing applications that are critical to business management. In addition, I am currently studying computer science.",
        "futurePlansMsg": "My plan for the future is to expand into the development of mobile applications and software that is as simple as possible and will make users' daily lives easier."
    },
    "projects": {
        "technologiesUsed": "Technologies used",
        "realMsg": "REAL is a simple 2D game specially designed for the Brackeys Game Jam 2022.1 in one week.",
        "pongMsg": "Pong Mobile is a replica of the classic game Pong. The project was made using the Unity engine.",
        "chatAppMsg": "ChatApp is a simple online chat replica with basic functionality, implemented in the Laravel framework."
    },
    "experience": {
        "fullStackDevLong": {
            "usedTechnologies": "Working with <b>Yii2</b> (PHP 7.4 and 8.0) and <b>Angular</b> technologies.",
            "appDeveloped": "Development of an advanced ERP system responsible for handling technological, manufacturing, reporting and warehousing processes for customer needs.",
            "touchApp": "Creation of an application optimized for full-size touch screens that is a separate module of the ERP system responsible for handling and optimizing technological processes in production halls.",
            "attachmentModuleApp": "Design and implementation of a system module designed for records management, including revision and meeting individual client needs.",
            "apiModuleApp": "Create, optimize and coordinate the development of the system module responsible for exchanging data with an external system through an API.",
            "appDocs": "Creation of project technical documentation for internal use and audit of the National Research and Development Center.",
            "clientMeetings": "Organize and participate in meetings with the client to discuss industry issues, allowing the selection of appropriate technology solutions for the project under development."
        },
        "fullStackDevShort": {
            "usedTechnologies": "Working with <b>Yii2</b> (PHP 7.4 and 8.0) and <b>Angular</b> and <b>NestJS</b> technologies.",
            "appDeveloped": "Development of a system to track requests and manage project development.",
            "featureDeveloped": "Introducing functionality to better sort and categorize individual requests.",
            "secondAppDeveloped": "Development of a system that is an auction portal focusing on numismatics.",
            "skillsAcquired": "Gain experience related to work organization and code management in a team."
        },
        "apprentice": {
            "title": "Apprentice",
            "usedTechnologies": "Working with <b>Yii2</b> (PHP 7.4 and 8.0) and <b>Angular</b> and <b>NestJS</b> technologies.",
            "appTested": "Test the system based on a detailed test scenario prepared by the team.",
            "bugsFixed": "Resolve errors found during application testing based on a prepared scenario.",
            "skillsAcquired": "Gain experience in both frontend and backend architectures."
        },
        "fullStackDev": "Full-Stack Web Developer"
    },
    "footer": {
        "contactMe": "Get in touch with me:"
    }
}