{
    "basic": {
        "language": "EN",
        "may": "Maj",
        "july": "Lipiec",
        "august": "Sierpień",
        "october": "Październik",
        "currently": "Obecnie"
    },
    "landingPage": {
        "aboutMe": "O mnie",
        "projects": "Projekty",
        "experience": "Doświadczenie",
        "welcomeMsg": "Cześć, Jestem Aleks",
        "welcomeInfo": "Full-Stack Web Developer",
        "knowMe": "Poznaj mnie lepiej!"
    },
    "aboutMe": {
        "theBeginning": "Początek przygody",
        "currentState": "Obecny stan",
        "futurePlans": "Plany na przyszłość",
        "theBeginningMsg": "Mój związek z programowaniem sięga czasów gimnazjum. Od tego czasu poruszałem się po wielu językach programowania, ale tym, który stał się podstawą mojej przygody jest język C++. ",
        "currentStateMsg": "Jestem Full-Stack Web Developerem. Zajmuję się rozwijaniem aplikacji biznesowych mających kluczowe znaczenie w zarządzaniu przedsiębiorstwem. Dodatkowo studiuję informatykę.",
        "futurePlansMsg": "Moim planem na przyszłość jest rozwinięcie się w dziedzinie tworzenia aplikacji mobilnych oraz oprogramowania, które jest maksymalnie proste w obsłudze i ułatwi użytkownikom ich codzienne życie."
    },
    "projects": {
        "technologiesUsed": "Technologie",
        "realMsg": "REAL to prosta gra 2D zaprojektowana specjalnie z okazji Brackeys Game Jam 2022.1 w jeden tydzień.",
        "pongMsg": "Pong Mobile to replika klasycznej gry Pong. Projekt został wykonany z użyciem silnika Unity.",
        "chatAppMsg": "ChatApp to prosta replika czatu online o podstawowej funkcjonalności, zrealizowana w frameworku Laravel."
    },
    "experience": {
        "fullStackDevLong": {
            "usedTechnologies": "Praca z wykorzystaniem technologii <b>Yii2</b> (PHP 7.4 i 8.0) oraz <b>Angular</b>.",
            "appDeveloped": "Rozwój zaawansowanego systemu ERP odpowiedzialnego za obsługę procesów technologicznych, produkcyjnych, raportowych oraz magazynowych na potrzeby klienta.",
            "touchApp": "Stworzenie aplikacji zoptymalizowanej pod kątem pełnowymiarowych ekranów dotykowych będącej osobnym modułem systemu ERP odpowiedzialnym za obsługę i optymalizację procesów technologicznych w halach produkcyjnych.",
            "attachmentModuleApp": "Zaprojektowanie oraz implementacja modułu systemu przeznaczonego do zarządzania dokumentacją, obejmującego rewizjonowanie oraz spełniającego indywidualne potrzeby klienta.",
            "apiModuleApp": "Tworzenie, optymalizacja oraz koordynowanie prac nad modułem systemu odpowiedzialnym za wymianę danych z zewnętrznym systemem poprzez interfejs API.",
            "appDocs": "Tworzenie dokumentacji technicznej projektu na użytek wewnętrzny oraz audyt Narodowego Centrum Badań i Rozwoju.",
            "clientMeetings": "Organizowanie i uczestniczenie w spotkaniach z klientem celem omówienia kwestii branżowych, pozwalających na dobór odpowiednich rozwiązań technologicznych w rozwijanym projekcie."
        },
        "fullStackDevShort": {
            "usedTechnologies": "Praca z wykorzystaniem technologii <b>Yii2</b> (PHP 7.4 i 8.0) oraz <b>Angular</b> i <b>NestJS</b>.",
            "appDeveloped": "Rozwój systemu służącego do śledzenia zgłoszeń i zarządzania rozwojem projektów.",
            "featureDeveloped": "Wprowadzenie funkcjonalności pozwalającej na lepsze sortowanie oraz kategoryzowanie poszczególnych zgłoszeń.",
            "secondAppDeveloped": "Rozwój systemu będącego portalem aukcyjnym skupiającym się na numizmatyce.",
            "skillsAcquired": "Pozyskanie doświadczenia związanego z organizacją pracy i zarządzaniem kodem w zespole."
        },
        "apprentice": {
            "title": "Praktykant",
            "usedTechnologies": "Praca z wykorzystaniem technologii <b>Yii2</b> (PHP 7.4 i 8.0) oraz <b>Angular</b> i <b>NestJS</b>.",
            "appTested": "Przetestowanie systemu w oparciu o przygotowany przez zespół szczegółowy scenariusz testowy.",
            "bugsFixed": "Rozwiązanie błędów znalezionych podczas testowania aplikacji w oparciu o przygotowany scenariusz.",
            "skillsAcquired": "Zdobycie doświadczenia w zakresie architektur zarówno frontendowej jak i backendowej."
        },
        "fullStackDev": "Full-Stack Web Developer"
    },
    "footer": {
        "contactMe": "Skontaktuj się ze mną:"
    }
}